from openai import OpenAI
# Set OpenAI's API key and API base to use vLLM's API server.
openai_api_key = "EMPTY"
openai_api_base = "http://10.22.131.235:8000/v1"

client = OpenAI(
    api_key=openai_api_key,
    base_url=openai_api_base,
)

chat_response = client.chat.completions.create(
    model="dicta-il/dictalm2.0-instruct",
    messages=[
        {"role": "user", "content": "Annotate all entity mentions in the following text with coreference clusters. Use Markdown tags to indicate clusters in the output, with the following format [mention](#cluster_name)\n\nInput: למרות ש[מענקי קרן מקארתור](#) נועדו לשחרר את[ה מוכשרים](#) מ[נטל[ה השתכרות ל[מחיה של[הם](#)](#)](#)](#),[כמה מענקים](#) מגיעים תמיד ל[אנשים](#) ש אינם בדיוק נאבקים כדי לזכות ב[הכרה](#) ו ב[חופש יצירה](#) ([ה דוגמה ה עיקרית של[השנה](#)](#) היא[סוזן זונטג](#)). אם ב כל[זאת](#)[אתם](#) רוצים[סבסוד ל[מחשבה של[אתם](#)](#)](#) ו ל[מעשה של[אתם](#)](#), על[אתם](#) להשיג את[הוא](#) ב[ה דרך ה מיושנת](#) : לפנות ל[ה קרן](#), ו לשכנע[אנשים[בעלי כסף](#) ש[אתם](#) זכאים ל[חלק](#)](#) מן[הוא](#). להלן[כמה עצות](#).[עצה מספר 1](#) : הצטרפו ל[ה גופים](#). כמעט אף אחד מ[שבעה מיליארדי ה דולרים ש[קרנות אמריקאיות](#) מחלקות[מדי שנה](#)](#) אינו מיועד ל[יחידים](#).[זו](#)[אחת ה סיבות ל[כך](#) ש[מענקי מקארתור](#) מבוקשים כל כך](#). ב[דרך](#)[כלל](#) מופנה[ה כסף](#) ל[קולגים](#), ל[מכוני מחקר](#), (כולל[צוותות חשיבה](#)), ל[קבוצות ל[שירות קהילתי](#)](#), ל[מוזיאונים](#), ל[ספריות ו ל[ארגונים אחרים](#) ש לא ל[מטרות רווח](#)](#). משום[כך](#), ראשית[כל על[אתה](#)](#) לחשוב על[קבלת[תפקיד חשוב ב[אחד מ מאות ה גופים הללו](#)](#)](#).[אז](#) תוכל לתור אחר[כסף](#) ב[אורח עצמאי](#) פחות או יותר, אפילו לייסד במשך[ה זמן[מכון](#) משל[אתה](#)](#) ב[מסגרת](#)[ה מכון[נותן ה חסות](#)](#), למרות ש[נותן ה חסות של[אתה](#)](#) ירצה[אחוז שמן מ[ה מענק](#)](#) כדי לכסות\"[הוצאות קבועות](#)\". אם[אתה](#) מעדיף לפעול בלי[איש[ביניים](#)](#),[אתה](#) יכול להקים[ארגון משל[אתה](#) ש לא ל[מטרות רווח](#)](#). כך נהג[[איל ה הון[בעל[ה מודעות ה חברתית](#)](#)](#)[טד טרנר](#)](#), כאשר מימן את[\"ה התאחדות ל[עולם טוב יותר](#)\", ה מבקשת[מענקים מ[קרנות](#)](#)](#) כדי להפיק[סרטי טלוויזיה דוקומנטריים](#). לפעמים, אחרי ש קיבל[מימון פטור מ[מס](#)](#) באמצעות[ה התאחדות של[הוא](#) ש לא ל[מטרות רווח](#)](#) מקרין[טרנר](#) את[ה סרטים ה דוקומנטריים](#) ב[רשת ה טלוויזיה של[הוא](#) ה קיימת בהחלט](#) כדי לשאת[רווחים](#) ו ב[רשתות אחרות כמו[היא](#)](#). אבל אל[תטרחו](#) לדווח ל[ה שלטונות[ה מקומיים](#)](#).[ה גבול בין \"שלא ל[מטרות רווח](#)\"](#) ו בין \"ל[מטרות רווח](#) \"מטושטש מאוד, ו ב[דרך](#)[כלל](#)[הכל](#) חוקי למהדרין.[ה דוגמה ה ידועה ביותר[לשמצה](#) מ[ה תקופה ה אחרונה](#)](#) היא[ה שימוש ב[כספי[קרן גאנט](#)](#) ל[רכישת[אלפי עותקים של[ה אוטוביוגרפיה של[[יו\"ר גאנט לשעבר](#),[אלאן נויהארט](#)](#)](#)](#)](#)](#).[ה דבר](#) סייע להכניס את[ה ספר](#) ל[רשימת](#)[רבי](#) -[[ה מכר של\"[ניו יורק טיימס](#)\"](#),[מעמד ש ב[דרך](#)[כלל](#) גורר בעקבות[הוא](#)[מכירת[עשרות אלפי עותקים נוספים](#)](#)](#)](#).\nOutput: למרות ש[מענקי קרן מקארתור](#cluster_0) נועדו לשחרר את[ה מוכשרים](#"},
    ]

)
print("Chat response:", chat_response.choices[0].message.content)
